// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// Console.WriteLine("Введите число:");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num <= 7 && num > 0)
// {
//     if (num==1)
//     { 
//         Console.WriteLine("Сегодня у нас Понедельник");
//     }
//      else if (num==2)
//     { 
//         Console.WriteLine("Сегодня у нас Вторник");
//     }
//      else if (num==3)
//     { 
//         Console.WriteLine("Сегодня у нас Среда");
//     }
//      else if (num==4)
//     { 
//         Console.WriteLine("Сегодня у нас Четверг");
//     }
//      else if (num==5)
//     { 
//         Console.WriteLine("Сегодня у нас Пятница");
//     }
//      else if (num==6)
//     { 
//         Console.WriteLine("Сегодня у нас Суббота, а значит выходной!");
//     }
//      else if (num==7)
//     { 
//         Console.WriteLine("Сегодня у нас Воскресенье, а значит выходной!");
//     }
// }
// else
// {
//     Console.WriteLine("Такого дня недели нет");
// }


